{
  "add_cross_attention": false,
  "architectures": [
    "BertForTokenClassification"
  ],
  "attention_probs_dropout_prob": 0.1,
  "bos_token_id": null,
  "classifier_dropout": null,
  "directionality": "bidi",
  "dtype": "float32",
  "eos_token_id": null,
  "hidden_act": "gelu",
  "hidden_dropout_prob": 0.1,
  "hidden_size": 768,
  "id2label": {
    "0": "O",
    "1": "B-PESSOA",
    "2": "I-PESSOA",
    "3": "B-ORGANIZACAO",
    "4": "I-ORGANIZACAO",
    "5": "B-LOCAL",
    "6": "I-LOCAL",
    "7": "B-LEGISLACAO",
    "8": "I-LEGISLACAO",
    "9": "B-JURISPRUDENCIA",
    "10": "I-JURISPRUDENCIA",
    "11": "B-DATA",
    "12": "I-DATA",
    "13": "B-VALOR",
    "14": "I-VALOR"
  },
  "initializer_range": 0.02,
  "intermediate_size": 3072,
  "is_decoder": false,
  "label2id": {
    "B-DATA": 11,
    "B-JURISPRUDENCIA": 9,
    "B-LEGISLACAO": 7,
    "B-LOCAL": 5,
    "B-ORGANIZACAO": 3,
    "B-PESSOA": 1,
    "B-VALOR": 13,
    "I-DATA": 12,
    "I-JURISPRUDENCIA": 10,
    "I-LEGISLACAO": 8,
    "I-LOCAL": 6,
    "I-ORGANIZACAO": 4,
    "I-PESSOA": 2,
    "I-VALOR": 14,
    "O": 0
  },
  "layer_norm_eps": 1e-12,
  "max_position_embeddings": 512,
  "model_type": "bert",
  "num_attention_heads": 12,
  "num_hidden_layers": 12,
  "output_past": true,
  "pad_token_id": 0,
  "pooler_fc_size": 768,
  "pooler_num_attention_heads": 12,
  "pooler_num_fc_layers": 3,
  "pooler_size_per_head": 128,
  "pooler_type": "first_token_transform",
  "tie_word_embeddings": true,
  "transformers_version": "5.2.0",
  "type_vocab_size": 2,
  "use_cache": false,
  "vocab_size": 29794
}
